[{"Content":"Good place to workout . But Im tried of picking up after people and i dont even work there or get paid . If you take the weights off please return them where you found them . Dont leave them on the bars or on the floor or benchs . For other people to move to do there workouts .","Sentiment":0.125,"Source":"Facebook Review Chi Fitness"},{"Content":"I really like this place,  I go to Sunway Velocity,  near my house. I was never a gym person, but this place makes me feel comfortable, the staff are really friendly, helpful and reliable. Keep up the good job guys!!!","Sentiment":1.625,"Source":"Facebook Review Chi Fitness"},{"Content":"Was absolutely bad! When I had the agreement with chi-fitness it does mention that no contract and told me that I'm able to terminate “anytime”. But just now I cannot terminate my account. He says that my account is under freeze this month. That is the only reason he gives and asks me to wait for next month to terminate the account. So this means I need to pay for another month.This is not reasonable and it is cheating. Very disappointing to one of the worker which have a bad attitude. To people who consider joining gym kindly reconsider before you join!","Sentiment":-2.625,"Source":"Facebook Review Chi Fitness"},{"Content":"Well for me, I go to Damen though it's a much smaller gym in terms of size as it is much closer to home.Also parking there is no hassle.I feel the warm & friendliness of both members & staff there. Been here close to more than a year now since April last year.The current Club Manager, Soheil is friendly & helpful and always there to ensure smooth running procedures & cleaniness of the gym.Then there is superwoman SOUDY who teaches at the same time and assist Soheil on other matters pertaining to schedules of classes & other matters.I will and always will be a faithful & loyal Chi-X Member! Hope the gym will be upgraded soon to cater for the growing members especially x-members from True Fitness who has came to join us since the Club was closed down permanently.Kudos once again to the Management & Staff of Chi-X Damen..Keep up your good work!","Sentiment":2.75,"Source":"Facebook Review Chi Fitness"},{"Content":"Hi .. I wish to feedback Chi Fitness at Queensbay Mall Penang ~ Overall great experience but the speakers workout studio were not functioning well since 2 years ago. The interim solutions been applied by installing temporary speakers (sitting on the floor) and until now the main speakers still not functioning or being replaced (~ this has been dragged for 2 years!!!).. the sound systems been annoying and impacting the overall workout sessions for the past 2 years. Appreciate if you could resolve the sound systems issue asap. Thanks in advanced for your support and help.","Sentiment":-0.375,"Source":"Facebook Review Chi Fitness"},{"Content":"Hi Chi Fitness, I wish to lodge a complaint on a manager at your c180 branch. When I joined membership few months ago, my account was deducted 2 times of the fee. So I requested for refund, and the manager kept telling me that it is in progress. Every time I follow up, he promised to refund but ended with no news. Until recently he never pick up my call anymore. Please assist to follow up and take action on this matter.","Sentiment":-1.25,"Source":"Facebook Review Chi Fitness"},{"Content":"Chi-Fitness IKON is one of the best fitness center I have came across. Clean, lots of light, spacious (perfect for personal training or having space for your floor excercise), the staff are professional and very friendly and the trainers are very good...also, it has a very vibrant community with many interesting events (Arabian nights, etc. etc..). I enjoyed it very much.","Sentiment":4.75,"Source":"Facebook Review Chi Fitness"},{"Content":"please becareful of leonardo from queensbay mall  he is manager of chi fitness who threatens customer  if they dont pay on time he wont let them in  they have even a staff indian guy pretends to be police inspectors  please becareful of chit fitness penang QBM","Sentiment":0.5,"Source":"Facebook Review Chi Fitness"},{"Content":"Hi, today i went to Atria mall CHI fitness for first trial with my friend.  When we were leaving and stand in front of the excess door\/gate, i asked for the Indian girl staff and told her today is our trial ( of couse,we don't have excess card!) She starred at me and said : so...? (with her unfriendly face) She wad trying to talk non sense with her BAD face After that, she simply asked me to take the card from the desk. So , I just took the card and touch it on the door but the card didn't work. She show her face again and I think she was not willing to serve us!!!! This happened around 9pm 11\/07\/2017 Well, you work at front desk... we might be CHI Fitness future customer as well... your attitude is going to spoilt CHI fitness  Seem like this staff not willing to serve trial customers! Of course, this will make me re- consider to join this fitness.","Sentiment":-3.125,"Source":"Facebook Review Chi Fitness"},{"Content":"Nowdays  management were duin unstoppable nonsense things until they cant  run a business because didnt earn much more profit and they have to closing gym because of some shit  or as**ld who in the management....come la men u HV to  know which is the better...izit the China fon can replace the iPhone...they did the same mistake as I gave example...if u guys notice previously when a person who want ruin a business need to have experience more then 5 to 6 year...example person like dave anand stevan Lai...nowdays who work in factory site or hotel site can replace the place...hahahaha come LA...how can!!! If zero knowledge in fitness industry person  who can lead hole entire means gone LA...the founder should notice this issue previously... If they maintain the experience person means won't came out any issue like closing all.....","Sentiment":-0.5,"Source":"Facebook Review Chi Fitness"},{"Content":"I went to your gym at Bangsar South on 4th August 2017 at 5 plus p.m.  I was working on my leg press, followed by bent over exercise (superset).Whilst I was doing the bent over exercise, your staff by the name of Imran Haqem approached me hastily and told me to put back the weights off the leg press without confirming whether I had finished using the leg press or understanding that I was supersetting.  Though he apologised after I explained that I was not done yet, the main issue was that he should have asked me first if I had done using the leg press instead of jumping into conclusion that I purposely left the weights there.  If I were to conduct a training session on communication skill for your staff, the first rule is seek to understand before being understood : You ask others for further details or confirmation before jumping into any conclusion. In any circumstances, it is always a smart move to give people the benefit of the doubt, isn't ?  The past is past but my concentration was affected by the interruption and I was unhappy over it and his uncompromising attitude.  Please communicate with all your staff about how to deal with customers.","Sentiment":4.125,"Source":"Facebook Review Chi Fitness"},{"Content":"I've been a CHI member since 2014 and been changing from C180 to now passport member frequenting Atria, PJTC and ESM. I'd say CHI is not the most expensive and is quite reasonably priced -therefore, I asked for the Management to take account into Customer Service, branding consistency and quality of the facilities at the gyms. For many weeks (at the same gym), some Mics have been spoilt and pity the instructors who have to shout throughout the class, the hooks in the shower not replaced for over 6 months (Mr. DIY is just next door?), water dispenser not working and other misc things which is still happening today. Since the membership is reasonably priced this does not means amenities and customer service has to be compromised. I enjoy the classes and there are many supporters of CHI. To the Management (and not just Marketing or PR Dept), please take this seriously and members will just port out to other gyms which is only 10-20% more expensive since the overall quality of the gym is deteriorating. Please remember that many of us seek to have a overall well-being experience at gyms. Walk the talk. ''Chi Fitness is Malaysia's best loved fitness center.''","Sentiment":-1.0,"Source":"Facebook Review Chi Fitness"},{"Content":"Same here, I'm totally disappointed I have already stop my contract since May'17 but they start charge me on Dec'17, I did walk in to Atria Chi, but seem like non of them can help and  just tell me: will get back to me... till now this month is my 2nd month still charge on my credit card , I'm really frustrated with this kind of service..... Very bad service","Sentiment":-0.125,"Source":"Facebook Review Chi Fitness"},{"Content":"Hi! I have been a member of CHI Fitness Starling for about over a month now.  From the day I self walked in to the gym to enquire about their membership, to my 13th PT session today, this gym has become my 2nd home  .  The staff here are really attentive and never fail to greet you with a smile.    If you wanna loose weight, tone up and look great for 2018\/CNY, look for my Personal Trainer, FAIZZAL   .   Faizzal has taught me lot about weight & strength training. Ask him for a Free Body Accessment\/Consultation!   For membership, you can look for Shark. (Don't worry he is not a loan shark  )  Thank you CHI Fitness Starling! Keep it up guys! Cheers!  ","Sentiment":1.75,"Source":"Facebook Review Chi Fitness"},{"Content":"Chi Fitness Damen is my stress reliever playground! Good ambiance! Staff, instructors and coaches are approachable! I met new friends and it's like my 3rd family too. It's always packed during weekdays but it's up to you on how you manage your workout schedule. I do hope that they will open RPM \/ Spinning class. Grid and TRX classes are awesome! Combat and Pump are the best classes still! Keep it up CF Damen!!!","Sentiment":4.125,"Source":"Facebook Review Chi Fitness"},{"Content":"I really disappointed and fed up for what the services of chi fitness at starling mall given. I was terminated my membership in earlier August for September onwards and signed the termination form. But it still charged me in September and October. When I asked the staffs, they just told me the admin was on leave and might be missed my termination form. What an excuses! I went starling few times to check the status and wish to speak with the manager, they just reply me that their manager is not there and will call me back about the refund, but no one is return call after a month!!! And I am still waiting their reply till now. Really bad management and service they provided.","Sentiment":-1.5,"Source":"Facebook Review Chi Fitness"},{"Content":"The hot water shower in the ladies changing room in Nexus Chi Fitness stopped 16 Jan 2018. Upon enquiry, gym staff mentioned that it will be fixed within that week itself.   2nd Week. Come the following week of 22 Jan 2018. I enquired the gym staff, again they said it will be fixed within the week itself. This time I called up the gym manager as well. He mentioned that payment is being processed and he will personally follow up and fix the hot water shower within the week of 22 Jan 2018.   3rd week arrived. 29 Jan 2018 week.  Enquired again.  Same response. Will be fixed within the week itself because payment is being processed.  How long does it take for the management to approve a single payment in this age and time? It doesn't seem like any action is being taken, nor complaints is being heeded. Also, since there's no hot shower, management is actually saving electricity tremendously. They should be giving the poor ladies who have to endure the cold shower early in the mornings refunds in their gym membership!","Sentiment":-0.25,"Source":"Facebook Review Chi Fitness"},{"Content":"I am extremely dissapointed. My gf and I both enrolled with Chi Fitness because I was tempted by their October Deepavali promotion. I cancelled a day after I enrolled because the gym centre was too pack, it is totally different than what the manager who showed me around during the Deepavali public holiday, and said 'it is always like this, not too crowded'. The next day I went for gym, I have to queue for any machines. So since it was stated on the agreement I will not be charged if I cancel within 5 days after enrol, both of us filled up the cancellation form the next day after enrolling. That was October. The system continue charging me RM149.00 from November and December. Apparently Chi Fitness only cancelled 1 account and lost the cancellation form for another account. This is my 3rd time going back to the same branch to ask them for refund.  Their staff keep saying 'we cannot refund and cancel until we found the firm's. Hey man, third time I return, and today, went back to ask for the status. A staff said : well we cannot refund, and we will still charge u another month. I believe they will cancel your account and refund later but we will still charge you???? What is going on. I guess the next round I will not return to them to ask for the status. I will report to the police since this is a fraud case.","Sentiment":-4.375,"Source":"Facebook Review Chi Fitness"},{"Content":"I would like to address my concern regarding to the customer service issues to Chi-X Fitness - Starling Mall management.   Below are the two incidents which happened during my recent visits:  No hot water supply- at the end of January 2018 I understood that it might not the tenant's problem as water supply should be part of the mall facility management.  However I think that the gym management could do better in sending a SMS or at least an email to inform the customers about the inconvenience in advance. I could not tolerate where I was told to have e a cold shower in the early morning at 7 am once I reached the gym, the worse case is that I was having an upcoming important appointment at 9 am nearby which I got no other alternatives to go for. It definitely ruined my day!  Fire Drill at the mall- today (08.02.2018) I believe that all tenants have been well informed by the mall management if there is any fire drill practice. Please do better in sending an SMS or at least an email to inform the customer in advance. I was rushing out from the bathroom this morning as I am not sure whether it was a real fire alarm a or just a fire drill practice.  I would not want to risk my life for that uncertainty. Kindly imagine the uncomfortable and inconvenience which caused to your customers.  I hope that the management would take this into deep consideration as customer experiences play an important role to the customers while doing their product\/service selection.","Sentiment":-3.875,"Source":"Facebook Review Chi Fitness"},{"Content":"Never did imagine how many people have been tormented with the same weight loss issues as me.","Sentiment":-0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"any promo for chi fitness?? really wanna join chi...","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Anything  about    is very important","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"Hi, i am still having problem to access timetable class through your website. Please la do something. I am so stressful with this problem. I cannot plan my time for workout if i cant access the timetable. This was not first time happen to me. Many times already. do not tell me you are still in the process of upgrading your system. When the problem occurs, you will rise up the same reasons. Come on la. Upgrading the system is like forever.","Sentiment":-2.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"anyone else love  this post as much as me  #trainerplus","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"posts like this are why  everyone likes  facebook","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"posts  about great fitness advice are why  everyone likes  facebook   #trainerplus","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"They make dropping weight seem awful simple here. Do you agree?","Sentiment":-0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Amazing  post  very interesting","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the info","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Dah submit form free trial, but no feedback.","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Pumped up Kicks.\"you better run better run, faster than my bullet.\"","Sentiment":1.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the info","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Only for 1 month? Or the next month still rm60?","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"ShwuJiun Kok interested ??","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Jing Yuan so cheap","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Elyn Hee you want?","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Joining fee not membership fees people!","Sentiment":-0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool  post thanks this is really great more on the best training techniques please  #trainerplus","Sentiment":2.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Monthly will b how much?? And this promo is for one day or wat??","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"I believe RM60 only for joining fee for new members to sign up, instead of RM99. However we still need to pay for monthly commitment as usual, like the cheapest one RM129 for Home Club and etc. Am I right, Chi Fitness?","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"what is the catch?","Sentiment":-0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Great very interesting","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Regular exercise strengthens the heart and improves contractile function who agrees","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Planets best  super fan right here","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"this is certainly pleasant.","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"IMO stuff about  are fab","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Great   love","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Stuff   about top training tips are why  I like  social media   #trainerplus","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"IMO anything about Fitness Models is fab","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Exercise not only will increase the total number of calories that you burn, but also can increase your resting metabolic rate, so you burn more calories while at rest who agrees","Sentiment":-1.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"What's the fees like?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"most people love publish in this way.","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"that publish provides more desirable informations. with thanks.","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"I indulge in food without much exercising, which resulted my weight increased to 85kg. Three years ago, I started looking at my health condition seriously by doing cardio workout every day, from brisk walking on the treadmill to riding stationary bike. I managed to shed off 20kg in one year. I completed my first full marathon last year and there will be more runs to come. #TransformationTuesdaywithCHi","Sentiment":1.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Hoping that the prize could be a free membership so I could work harder to achieve my ideal body goals with CHI. Since 2012 I've been struggling in weight problems. Although I've managed to lose around 15kgs since then, I wasn't motivated enough to reach my fitness body goals. The photos shown is the best state I've managed to reach but I've been slacking again nowadays and I do not hope that I'll go back to the old me! #TransformationTuesdaywithCHi","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Left pic is on early of 6th Aug'17, right pic is on 12th Sept'17. I lost 1.5kg and trim part of my belly with wide shoulder and built up biceps. #TransformationTuesdaywithCHi #chifitness","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"#TransformationTiesdaywithCHi  From 84kg with height 161cm to 60kg. Thank you Chi fitness for providing me a conducive and inspiring atmosphere to encourage me with my workout. I ❤️ Chi Fitness 🙂","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Its about time to share my sucess ..  Start diet and eat healthy  = 20th March 2014 110kg and now 75KG Kg lost= 35 kgs in 4month ++  This is Me Now  Remeber this \"Giving up is the easiest thing you could ever do, but holding it all together when everyone expects you to crumble, that is true strength  CELEBRATE WHAT YOU 'VE ACCOMPLISHED . BUT RAISE THE BAR A LITTLE HIGHER EACH  TIME YOU SUCCEED  #TransformationTuesdaywithCHi","Sentiment":1.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"I love this fan page Thanks  for the post :)","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"I think everything about Diet is fantastic who agrees?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"posts like this are why  everyone loves   this page","Sentiment":0.75,"Source":"Facebook Comment Chi Fitness"},{"Content":"magnificent, acquire a praise.","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"anyone   like   this post as much as me","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the info","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Stuff   about the best training techniques are why  everyone loves   facebook   #trainerplus","Sentiment":1.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"But remember  Health is not simply the absence of sickness.   ~Hannah Green","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Health best home ever?","Sentiment":1.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"A lot to understand when it comes to losing weight.","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Nice post thanks  love Fitness Models","Sentiment":1.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Soon Lily u can try","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Absolutely adore  anything like this","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"I think  posts about the best training techniques is fab who agrees? #trainerplus","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"Important Info","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Who else really loves this Slim?","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Interested!","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"nice! the c180 outlet is amazing and the service is attentive","Sentiment":1.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Important Info","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"I think  anything about  is fantastic who agrees?","Sentiment":0.75,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the info really interesting #trainerplus","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"such a great  post","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the post big top training tips fan here #trainerplus","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the post","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Amazing job, Mike Lamb! 👏🏼👏🏼👏🏼","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Who else loves  ?","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Stuff   about top training tips are why  everyone loves   this page  #trainerplus","Sentiment":0.75,"Source":"Facebook Comment Chi Fitness"},{"Content":"Nice  thanks I love weight loss","Sentiment":1.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the info really interesting #trainerplus","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the post big  fan here","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Last night party","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Kyrie Riza bro you have to participate","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"IMO posts about  is fab who agrees?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"such a great  post","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Are you aware of any fast ways to lose weight in a short time period?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Anything  related to Fitness Models  is really important","Sentiment":1.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"No excuse","Sentiment":-0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"It's now or never","Sentiment":-0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Important Info !","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool  info thanks  really great more on fat loss please","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"posts  about  are why  everyone likes  this page","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"yessssss. thank you!","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Absolutely love everything about","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"Love it!","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"They make losing weight seem awful easy here. Do you agree?","Sentiment":-1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"This is right . You know.It  s awesome.","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"anyone else  like   this post as much as i do  #trainerplus","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks  for the post","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"IMO anything about  is fantastic","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks for the great info.","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"posts like this are why  everyone loves  social media","Sentiment":0.75,"Source":"Facebook Comment Chi Fitness"},{"Content":"Worlds best dieting super fan right here","Sentiment":1.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"I like it","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Tremendous very informative","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Steady bro Harizon Ramli","Sentiment":-0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"More stuff like this  ok? like if you agree","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"I have used plenty of ways to drop weight with no gain. This looks promising.","Sentiment":-0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Awesome very interesting I loved Low Carb","Sentiment":1.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Who else loves this Diet?","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Why no grit strength????","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Box n Burn","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"How much box and burn?","Sentiment":-0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"Where is your CHI location?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"I wish that I had bumped into this site a long time ago","Sentiment":-0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"who else gets fitness ?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Are we gins have shbam back In ikon?","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Chi ESM no Shbam 😤 Pls add more dancing classes n Pilates in the morning since Chi PTC members mostly tranfer to ESM here!","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Great sharing 👍","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"This is an amazing video, CHi Fitness! Good job! Keep it coming!","Sentiment":1.0,"Source":"Facebook Comment Chi Fitness"},{"Content":"Happy birthday Mr Ho","Sentiment":0.875,"Source":"Facebook Comment Chi Fitness"},{"Content":"Hero","Sentiment":0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks to Chi Fitness, they not only gave me a surprise birthday party but also hosted a birthday lunch and a dinner at night. Many, many thanks to Chi Fitness.","Sentiment":-0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Great sharing Chi fitness Penang. Happy birthday Mr Ho. Big smile on Leo’s face!!!","Sentiment":1.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Happy Birthday uncle..may u stay fit n cheerfull always💝","Sentiment":1.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Awesome   very interesting","Sentiment":1.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Amazing  post  very informative","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"lol santa suits should not belong to fit looking muscular men ...looks wrong or that's just me haha #merrychristmas! :)","Sentiment":-0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Thanks","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Hi Chi Fitness, I wish to lodge a complaint on a manager at your c180 branch. When I joined membership few months ago, my account was deducted 2 times of the fee. So I requested for refund, and the manager kept telling me that it is in progress. Every time I follow up, he promised to refund but ended with no news. Until recently he never pick up my call anymore. Please assist to follow up and take action on this matter.","Sentiment":-1.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Who else loves","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"no offer for new member?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Eat lesser fatty crabs lol","Sentiment":-0.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"I think everything about fitness is fantastic who agrees?","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Interesting point, I never studied that idea, have you?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Soon Lily","Sentiment":-0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Who else loves bodybuilding","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Are you aware of any swift ways to lose weight in a short time period?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"More info on  please like if you agree","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"who else has seen   our fanpage  ?","Sentiment":0.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool...","Sentiment":0.5,"Source":"Facebook Comment Chi Fitness"},{"Content":"Cool  info thanks this is really great more on  please","Sentiment":1.375,"Source":"Facebook Comment Chi Fitness"},{"Content":"Interesting point, I never investigated that idea, have you?","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"},{"Content":"Any handsome fair PT or Instructors who specializes in building muscles at buttocks? Lai PM","Sentiment":1.25,"Source":"Facebook Comment Chi Fitness"},{"Content":"Amazing  post  very interesting  I love Fitness","Sentiment":0.625,"Source":"Facebook Comment Chi Fitness"},{"Content":"My beloved, all of this. I just like it. Great.","Sentiment":0.125,"Source":"Facebook Comment Chi Fitness"}]