[{"Content":"I’ve been a member of FF for many years. Of late I can see the dropped in standards in my home gym in Empire Subang. Water disruptions, issues with hot water and cleanliness to name a few. I’m still holding on the my membership due to the lack of better gym. Please buck up FF! The best part is every time I ask to see the manager he’s never around  ","Sentiment":1.625,"Source":"Facebook Review Fitness First"},{"Content":"Poor services and i had been cheated by u!  As u were agree to offer me the previous rate, but ur system charge my for 3months normal rate!! When i call to the staff and complain, they were just give me so many excuses and brush me off!!! Shit!!! Damn!!!   Liar!!!!","Sentiment":-1.625,"Source":"Facebook Review Fitness First"},{"Content":"Hi I have been a fitness first member for more than 5 years now. Of late I have been going for classes at Paradigm and empire for the past one year with Empire being my home gym. Today after classes in paradigm as usual I would take a shower get changed n leave. BUT today some member stole my gym shoes which was put with many shoes under the bench. This is the first time in years that when I left my shoes outside the locker that it was stolen! Yes it's my mistake of leaving it outside but this was a norm as the shoes would be wet. I'm not asking for any compensation or anything of such. I would just like to express my greatest disappointment on how would the other gym members steal from the gym, has this ever happen?!? Appreciate if you could check on the security of the gym\/ type of ppl that join as members or maybe even ppl that join on trial and also acknowledge that this actually did happen at your Paradigm Fitness First Centre.   This is specifically to PARADIGM FITNESS FIRST, Rest assured I have no problem with the quality of the gym in other any areas.","Sentiment":-0.75,"Source":"Facebook Review Fitness First"},{"Content":"Setia City mall class schedule in app and website both stated there is a 9.45am pilates class. When I reach here there is no class, the board has changed but why not update the website and app too? If only the board is accurate who is so free to come check the board everyday? Dont you have a standard operating procedure?","Sentiment":1.375,"Source":"Facebook Review Fitness First"},{"Content":"I think FF members like to roll in the sweat of others. There is no other way to explain why hardly anyone wipes the equipment after use or even places a towel between their soaked body and the machines.   The other day (Setia City) I was the only one using a towel among 11 (!!) athletes working out in the free weight section.   Not even the trainers display basic hygiene but using towels \/ wiping equipment.   Shudder....","Sentiment":-0.625,"Source":"Facebook Review Fitness First"},{"Content":"Relocation of FF IOI Mall has made me and many others disappointed with the way management handled things. All weeknight yoga classes have been cancelled and replaced all with cardio classes. How can this be? Are the cardio-goers paying more fees that the yoga-goers? Where are yoga-goers supposed to go for yoga after work now? The group exercise studio is supposedly larger and yet, there is no room for yoga-goers?","Sentiment":-0.125,"Source":"Facebook Review Fitness First"},{"Content":"Poor service. Couldn’t even provide basic necessity such as small \/ hand towel especially in the morning specifically at Avenue K. Started tracking the incidents and noted that the hand towel was not available on 17 Oct, 20 Oct, 1 Nov & 9 Nov when I arrived at the gym around 7 - 7.20AM. No apology was offered. Kindly ensure your laundry to arrive on time as the gym operation hours start from 6.30AM on weekdays.","Sentiment":-0.875,"Source":"Facebook Review Fitness First"},{"Content":"Within 3 months plus I joined the FF, the staff lost my membership card twice. Now every time I go to the FF the curve Branch I have to be worried whether they will make my card lost again ... ironically, no calling me as promised by the staff regarding the card lost, instead they asked me today to show driving license whenever I enter the gym next time. Another 9 months to go before I terminate the membership if it is still no apology received from the management. That’s it.","Sentiment":-2.625,"Source":"Facebook Review Fitness First"},{"Content":"I have always prefer FF than other clubs, probably bcos i m a platinum member and platinum clubs are more ummph. Went to the club at Axis yesterday. Was surprised the weights equipments and stepboard in the GX room are those old ones. (Not sure other normal clubs r same). That is fine. But the main concern is the slippery flooring in GX room. Not sure if any member brought up this issue before. I couldnt do my best in squats and lunges as my legs were getting wider and wider as i did the squats n lunges. Same goes to bodystep. I dare not jump harder cos afraid of fallling due to slippery floor, could FF management improve the flooring?","Sentiment":-0.125,"Source":"Facebook Review Fitness First"},{"Content":"The facilities provided are not up to the standard with the amount of fee that we pay every month.... 1) The aircond at Empire was always faulty... 2) The hot water at Empire still not fixed it until today...raining season contribute to the cold weather 3) There's no point if your club manager walking around but cannot find the solution on the problem arise at the club (always saw at Empire)","Sentiment":-3.5,"Source":"Facebook Review Fitness First"},{"Content":"wish I read all the recent reviews here before I signed up. Regretting immensely after my horrible experience with their service and cannot even terminate my membership it seems as they are \"unable to refund\" (even though it was them that lied to me and didnt keep to their word and basically charged my card secretly). The staff that put me in this mess is still working there it seems, so future joiners be careful.","Sentiment":-1.75,"Source":"Facebook Review Fitness First"},{"Content":"I cancelled my membership since May 2017. I walked in to The Curve branch where I registered, filled the form and even got a cancellation email. But I am really disappointed that they keep on charging me the fees via direct debit. The latest one was yesterday, 21 November 2017. I lost almost RM1000 for the membership that supposed to be TERMINATED already. I have called to complain numerous times and when talking to staffs  there got me nowhere, I asked to speak to the manager. But, the manager seemed to be busy or in a meeting everytime. Everytime I called, the staff would say that the manager already addressing the issue, will terminate my membership and even promise to compensate the money that I paid. Months passed since then and I feel really angry even to call because I know it will get me nowhere. Maybe I should make a complaint elsewhere since asking politely to the branch involved seems useless.","Sentiment":-1.375,"Source":"Facebook Review Fitness First"},{"Content":"I have been informed very friendly by your front desk that fitness first Melawati Mall is only open to new sign up MM members. They mentioned that old members have been informed. The front desk mentioned that they got the memo from the GM this morning about this restriction. Please forward me the email as i might have missed.  I understand being so many years a platinum member is not eligible to have these benefits and have utter restrictions. So, please send me details on when i am able again to step my foot next in FF Melawati Mall.","Sentiment":2.75,"Source":"Facebook Review Fitness First"},{"Content":"I was conned to rejoin Fitness First with the promise of being given my old membership rate. The staff who promised left after I rejoined. When I confromted. fitness First,  they feign ignorance and put the blame on me,  that I didnt secure a black and white. When I was given my contract I had already highlighted it was not the rate I was offered. I was again told it will be rectified.  Finally I asked someone by the name of Alex who gave a false promise he will rectify the matter who also failed to follow through and assigned the blame on me. This is how they operate, not keeping their words. So beware you all, never trust anything they say.","Sentiment":-2.125,"Source":"Facebook Review Fitness First"},{"Content":"It took me one and a half hour to reach your Empire Subang club intending to attend your Gentle Flow Yoga at the pool side. I turned rounds and rounds to find parking in the mall and rushed into the gym to find that your Gentle Flow Yoga class at 730pm is not available?  There is nobody there. I have checked the club timetable just before coming and the class is on! Your counter person dont even know there is nobody there. She was even in disbelief and I had to double check it twice for her. She said the class is supposed to be on and she had to text to realise there is no class and just say a simple sorry. Do you know how much hassle or effort people put through to commute to the gym? Do you know how idiotic it feels to come to your gym and to be put off by the class is not on? And you do not bother to maintain the quality of your service?  When you are comfortably having your dinner now, I am fucking pissed with your club's services. Being a world renowed Fitness First, is this how you treat your customer?  I was your member for 7 years at the Curve. The same thing happened few times. You use your club studio for your own internal functions and not informing your customer. Frequently I was so disappointed to only realised classes cancel only upon at your club premise.  Seems like your club service has not improved after all these years. Bloody disappointing Fitness First! Nobody cares and just take this lightly. I really have zero confidence in your classes now. You seriously dont care about your club image at all.   #FitnessFirst #FitnessFirsMalaysia #FitnessFirstMalaysiaEmpireSubang","Sentiment":-0.5,"Source":"Facebook Review Fitness First"},{"Content":"Horrible experience with this club. They will take your money without your authorization. I sustained a muscle\/tendon injury during one of my sessions there so had to stop and freeze my account with a doctor's letter. However after 6 months they reactivated my account without first informing me or asking if I was okay to return. I didn't check my credit card bill for a few months but when I did I realized they had charged me for 6 months already. Cut a long story short. I tried to cancel my membership (I was not on contract anymore) because my shoulder was still stiff and there was no way I could return to my normal classes. Tried to cancel my membership and ask for a refund on the 6 months fees that they tried to charge. It was impossible for them to agree. I have been fighting to get my money back and for them to waive the freezing fees to no avail. This club does not care about their members. It's all about the money for them.","Sentiment":-4.875,"Source":"Facebook Review Fitness First"},{"Content":"Poor service, poor management team.. I called to cancel my membership and your side give me many excuses, said that my contract have not end? Funny, when I sign up for the membership, your side told me that I can discontinue my membership after 3 months, and I have been joined FF for almost a year.. I cannot cancel my membership now? My sister join FF with me on same time, she have get her FF membership cancellation two months ago, but why I can't? And been told because my account been freeze?? Every month I pay full amount for the membership fee, if my account is in freeze condition then who is taking the money??  Plus, Trainer there also not good.. I sign up for 30 session, but until the session period end, my training session have not finish.. Always make appointment with trainer but at the end did not show up and not reply to my message, so mostly I do training myself, so demotivated..","Sentiment":-3.875,"Source":"Facebook Review Fitness First"},{"Content":"Fitness First's management service getting from bad to worst for my 15 years journey with them especially I am terminating my membership now. Terminating my membership in mid of Nov and was told this can't be done and will get someone from home club to call me on this matter and yet to receive any call for 2 weeks on this and personally call home club on early Dec due I am on oversea biz travel and was given lots of excuses and surprised to find out that my effective last day is on 31 Jan 2018 when checked. My intention is to terminate with immediate effect (which was told is 1 month notice, why is my friend been terminated immediately by FF without any reason) but end up with 2 months notice? Personally felt that Fitness First is now a 'Business First' club with their arrogant management attitude towards the loyal members.","Sentiment":-0.5,"Source":"Facebook Review Fitness First"},{"Content":"Best.","Sentiment":0.75,"Source":"Facebook Review Fitness First"},{"Content":"Respect and love it !! THE BEST OF THIS","Sentiment":1.25,"Source":"Facebook Comment Fitness First"},{"Content":"You just inspired me, awesome","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Winter Hardbrick what is ur excuse","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Dear friend, look at this guy, he is so determined even he has one arm, what about other, we have everything, there is not excuse for not doing it. Winner and fighter will never lose or quit .","Sentiment":-1.125,"Source":"Facebook Comment Fitness First"},{"Content":"How do I enrol if I am interested in this program? What is the cost like?","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Real spartan training ! Dnivrad Darvind","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Sakthidasan Subaramonia check it out 💪","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"You know how sometimes you meet someone who inspires you beyond words? Someone who helps you put life into a better perspective? Well it just happened  to me.. Met this tough young men CK Loh and battling a life physical defect since born.. He's one of the passionate and happiest men I've ever met, what makes it EXTRA COOL is when he just don't quite know how profoundly he inspire all those around him. For me.. Meetings like this are easily the greatest part of fame, my man.. great to met you and thx for inspiration - keep working hard buddy, remember....","Sentiment":0.375,"Source":"Facebook Comment Fitness First"},{"Content":"this all team is lai","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Nice","Sentiment":0.875,"Source":"Facebook Comment Fitness First"},{"Content":"only he want money","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Is this open for public?","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"Good warmup","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"So long and not rectified yet 😇😇","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"The lifts are already down for weeks. Now getting worse.","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Oooh i remember getting stuck in one of the lifts  The quality of the lifts are dodgy at the best...","Sentiment":1.375,"Source":"Facebook Comment Fitness First"},{"Content":"Fit people should not use elevator","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Simply use the stairs as warm up","Sentiment":0.375,"Source":"Facebook Comment Fitness First"},{"Content":"cannot blame FF entirely. The elevators belongs to Empire management and it has been like this for a looooooooooong time. Just that this time is worse.","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"Please help me renew my passport advantage. Someone please email me asap. Thank you.","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Hi, I faced this problem when i was registering. I did ask front desk for my membership number, but still wont work","Sentiment":-1.5,"Source":"Facebook Comment Fitness First"},{"Content":"HeyJom website is not recognizing my membership number -_-","Sentiment":-0.875,"Source":"Facebook Comment Fitness First"},{"Content":"Can I register via counter at Mid Valley branch or other branch as I don't use credit card","Sentiment":-0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Pei Yan Pei Zhen like a lot of fun playing latte","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Kindly sent detail please","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Kindly send the detail to me. Thank you","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Thank you ff for having this. I attended the special class by Sop Fan and Wai Wai. Both were enlightening. And hard work!  We so often hear 'use your breath' to help you. Yet we so seldom understand what it means. This class was useful for us to pause in our rush to perfect the pose to remind us that it's not the destination but the journey that counts. Namaste","Sentiment":-0.875,"Source":"Facebook Comment Fitness First"},{"Content":"Wahhh wrong timing bakket, punta ako cameron sa lunes, back thursday next week !! Roxanne Bagain","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Already registered.......","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Picture not clear at all... Better still not try to do something not worth at all.","Sentiment":-2.375,"Source":"Facebook Comment Fitness First"},{"Content":"Meng Wee Randy c u there tmr","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Too bad i balik kampung lahh","Sentiment":-1.0,"Source":"Facebook Comment Fitness First"},{"Content":"I am going for this .see you there :))","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"I coming but a bit late","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Melawati....i need to orbit a different galaxy like dat...so jauh...you strong sexy people have fun anyways.","Sentiment":2.125,"Source":"Facebook Comment Fitness First"},{"Content":"I want to go too but got 2xu run too :( TT","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Argghhhh!!! I totally cannot attend!!! Huhuhu.....my race category will start late....can only admire from Mont Kiara....😩","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"I wish I can attend it but I already registered for the 1 Mont Kiara Stairgathon event which held on the same day.","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Hi how much is Platinum (Home) membership for 1 year?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Wow The word is awektu","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Wow ok noted with thanks","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Hi FF, wonder do you have any membership that allow flexibility meaning I just need a month of membership?","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Burpees the best workout","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"this is at melawati mall?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"still feeling the x4 bear crawl after-effects...","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Don Sinongco go join with Am!","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"I looove ice cream 🍦","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Faiz, are you telling me you skipped my training session to work out with Lewis Hamilton and Valtteri Bottas?! 🤣","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Hi,  Please forward this email to the person in charged.  Talked to Azil just now from Fitness First Avenue K. So last month I called in to cancel my membership. I know that my 1 year tenure is coming end of Sept. Hence, its just nice as to serve a 1 month notice. Was told that Azwan Avenue K will call me in to assist on my cancellation, nobody did.   Then I walked in to confirm on my cancellation, apparently was told that Azwan was on leave for travelling, Geeta took my case.   Today I called in again to confirm(answered by Azil), was told that Geeta is on 2 weeks leave. Another manager will take my case, which interestingly that person is not around today as was told that the person needs to take care of two clubs.  I just want a confirmation that 30 Sept is my last day as I don't want to continue anymore. I hope I don't have to do a police report on this matter.  -Ezir Kushairi","Sentiment":2.625,"Source":"Facebook Comment Fitness First"},{"Content":"I like it","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Can we allow to go in since some of  the members aren't from Melawati's club ?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Eija Khadijah Dira Zakaria Norismaliza Ismayatin Sharizan Shariff Ann Khan Zeti Akhtar Mahtar Yati Akhtar jom open for public ni","Sentiment":-0.5,"Source":"Facebook Comment Fitness First"},{"Content":"So Fitness First FB admin, open to all or open to those sign up at Melawati only, posts by posts all are so confusing, it is near my house and I thought I could access by October. State it clearly as I dun wan to waste my time going there n cannot go in.","Sentiment":-2.125,"Source":"Facebook Comment Fitness First"},{"Content":"Hi. . Meaning the gym is now officially open for all platinum members?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Wow can i cancelled my existing membership and sign up with them???","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Simple marketing: if the gym looks empty, ppl would have the thought of \"expensive\", \"rip-off\", etc. If the gym is full of ppl, the potential customers would have thought the gym is good. So yea... if they have many new members, lain lah. Tgk la the whole week macam mana, penuh tak gym tu 😏","Sentiment":2.25,"Source":"Facebook Comment Fitness First"},{"Content":"This is so ridiculous. I am a first club member and when I walk into the club only was I told tht the priority is for melawati mall members for the first month..  Like seriously as if this branch is so damn special.. Only reason I'm here coz it's closer to my house.. When Gardens ff just opened I went there n there wasn't an issue.. If other ff branch members r not allowed then say so earlier..  Don't go posting on the page like it's open for every ff members...","Sentiment":-2.25,"Source":"Facebook Comment Fitness First"},{"Content":"Omg...i missed this today :( TT tgis","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Do I need to bring a member friend along with me during the open week?   Usually on open week, I (non-member) get stopped by the reception as I go in alone although it was clearly promoted as an open week. Thanks in advance.","Sentiment":-1.0,"Source":"Facebook Comment Fitness First"},{"Content":"Kudos to Fitness First for organizing this yoga retreat in Spa Tembok Bali. It is an amazing experience to practise yoga at garden facing the ocean accompanied by waves sound and sea breeze and of course the classes were taught by experience teachers i.e. Jamie Chow, Thomas Loong & team. I hope Fitness First Marketing will organise more retreats in future.","Sentiment":2.125,"Source":"Facebook Comment Fitness First"},{"Content":"The entire retreat was truly enjoyable. The marketing dept were excellent and the instructors were great.  Many thanks to Jamie Chow& Thomas Loong for their time to ensure we are comfortable and happy in the retreat from the beginning to the end. Their teaching skills are really good.   Thank you to FF Malaysia for organising this event too.","Sentiment":4.25,"Source":"Facebook Comment Fitness First"},{"Content":"Just love, love, love! Thoroughly enjoyed the yoga retreat thanks to FF & all the dedicated instructors. Loved the resort, the yoga sessions, the massages (given by both masseurs & the instructors!) & meeting new friends! Agree with Bee Yong on this trip being hard to top! Thanks Jamie Chow for convincing me to go!","Sentiment":3.625,"Source":"Facebook Comment Fitness First"},{"Content":"I m new to this group but greatly benefited from joining this great idea of a yoga retreat in romantic Bali.  Spa Village was a pleasant cosy secluded hotel location.  3 meals a day with so much Balinese chili! 😋 Instructors were friendly n attentive.  Perhaps needed some participant intros in order to gel the group although by 2nd day many had bonded.  Maybe a 5D4N retreat next?  Thanks Fitness First for organising this fun trip! 👍","Sentiment":2.75,"Source":"Facebook Comment Fitness First"},{"Content":"Thanks ff for organizing. We had an amazing time!  Lovely location, peaceful ambience, lots of fun things to do besides yoga everyday.  The attention and guidance of all your best yoga instructors. I think this will be a hard trip to top!","Sentiment":1.0,"Source":"Facebook Comment Fitness First"},{"Content":"This is what my teacher teach.","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"I like every single thing of the gym, except the window glass at the thread mill section. I cant hardly focus as the filter\/sun protection chequered box window sticker making me dizzy when I’m running.  I’ve asked few members and they thought the same tho.","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"Renee Low Lee Ping MeiKuen Foo 😍😍😍","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Love this!!!!!","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Thanks Terry Chong 😂 I look so funny 😂","Sentiment":0.375,"Source":"Facebook Comment Fitness First"},{"Content":"Hi 👋🏻 Eric Yap 😅","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Done. Very looking forward to it!!!","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Where is grit Kong Sei Key where is bodyattack YS Teoh","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Nice video Budi Ariyadi 😅😅","Sentiment":0.875,"Source":"Facebook Comment Fitness First"},{"Content":"Irene Puffer Wong nah the obstacles","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Grit strength","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"The First Lady at the left with Poly’s tail (3\/4 pants) should deserve as the winner 💪🏻💪🏻","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"The first 2 ladies in black are winners!!!!","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Good job, teacher Fred","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Can’t wait this event 😂😂see u all superstar 🤗🤗","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Amazing isometric ice skater #aiis","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Definitely joining","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"John Chang try getting hit by him... train kissing punch","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Wow i looking forward to it!!!","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Emma Anderson!!! This is sick!","Sentiment":-0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Fully booked?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"When I purchased the ticket I was told by your staff that I will be able to collect the participants kit at the club @SCM itself before the event. I am surprised now that the collection date has passed and there was not even an email to inform me on the collection date. Please solve my problem for me and deliver what your staff have informed me.","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"is there any free trail?","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Same like CF...","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Dear Sir \/ Madam  Firstly, I would like to thank Fitness First for organising the event “Fit In The City” on 4 Nov 2017, the very first event that I chanced upon and took part with my other group exercise members from Fitness First at The Gardens Mall.  It was definitely challenging as there were 11 thrilling obstacles for us to go through as a team. I am happy to share that our team completed the obstacle challenge with each other’s support and we did enjoy ourselves.  Though it was meant to be a test of our strength, endurance and cardio, I was very concerned about several safety issues as I felt that the safety measures at a number of obstacle challenges were not sufficient and not well thought out, specifically:  Most of the obstacles challenges were not set up properly, as some of the safety mattresses\/ cushions were not firmly installed and were scattered around.  Some of these did not even have any mattress\/cushion even though the risk of injury was obvious.   Each of the obstacle challenges should have been more closely supervised by the training staff. As safety measures were lacking, a fall could potentially result in a serious head injury. Some of them were not very alert or attentive even though the risk of head injuries was imminent. Our team had to cover the hard floor and move the cushion around as there wasn’t sufficient cushioning.  There was no medical assistance given to my team member who injured herself.    The last obstacle was not secured and the balance beam was very shaky for anyone to walk on. This was the case for the last obstacle challenge - the beam on the left was obviously not set up in a correct manner.  May I know who is the person in charge to write to regarding this? Can I have the email address as I couldn't find it on your website.  Thank you.   Yours truly Dylan Ng Membership No. 80010658","Sentiment":-1.25,"Source":"Facebook Comment Fitness First"},{"Content":"The best!!","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Miss it.....but im not sure do i still have power to do it haha","Sentiment":-1.5,"Source":"Facebook Comment Fitness First"},{"Content":"Looks like a good exercise for people has knees pain","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Andrew Story is you and Penny Pang.","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Any promo now and what is the mthly fees","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"What happened to the booking? I cant book a space! Thanks","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Adzre Are","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Thanks  big Strength fan here","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Thanks","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Good u","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Jessica Tan u can join this torture ur self 🙂","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"More posts on [health] ok? like if you agree","Sentiment":0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Where are the rest of the pictures?😏","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Wow bojio bro","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"What kind of boss would you like to do? Ade mknn take mksudnye pills to or else","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Just planned to go there to workout until 1 am because tgif is holiday :( TT","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Wow bojii bro","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"I pick up some money from the sofa (cafe area) at 11:45am today, I past it to the reception. Anyone???  (Some money with a black colour clip).","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Hi, Are u guys open today ie Christmas day? Esp the one at Empire Subang?","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Horrible experience with this club. They will take your money without your authorization. I sustained a muscle\/tendon injury during one of my sessions there so had to stop and freeze my account with a doctor's letter. However after 6 months they reactivated my account without first informing me or asking if I was okay to return. I did not check my credit card bill for a few months but when I did I realized they had charged me for 6 months already. Cut a long story short. I tried to cancel my membership (I was not on contract anymore) because my shoulder was still stiff and there was no way I could return to my normal classes. Tried to cancel my membership and ask for a refund on the 6 months fees that they tried to charge. It was impossible for them to agree. I have been fighting to get my money back and for them to waive the freezing fees to no avail.","Sentiment":-5.5,"Source":"Facebook Comment Fitness First"},{"Content":"FF SCM will be closed on these date?","Sentiment":0.375,"Source":"Facebook Comment Fitness First"},{"Content":"FF SCM, i think notice like this should be send out via SMS \/ Email rather than just through a FB page announcement. For those who don't follow this FB page and still ended turning up to the gym from 6.30am onwards will be disappointed and very much confused. Tqvm","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Happened before too!","Sentiment":-0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Fitness first will never improve its services. It will never learn from the fate of its competitors. There are crossfit clubs and smaller gyms taking over now. I am glad I did not sign up yesterday. The service is worse now. All promises on social media by Fitness first is lip service!","Sentiment":-1.25,"Source":"Facebook Comment Fitness First"},{"Content":"So what’s the compensation to members in this instance or does the club assume it’s ok?","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"I thought I was the only one that came without notice but unfortunately there is more 20 visitor was not inform from 7.30am, hopefully fitness first can give a notice via email,  SMS,  Msg and not only facebook","Sentiment":-2.375,"Source":"Facebook Comment Fitness First"},{"Content":"Hi Kenneth & KR, thank you for your messages. We shall take your feedback onboard and further improve in communicating these messages when they arise in the future. We apologise for any inconvenience caused to your workout routine.","Sentiment":-0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Bodyjam also wants Dance Tour 😜","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Mousey Fibs r u teaching? 😀","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Today ada buzz?","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"i was told that there will b only one multipurpose workout room in the new premise which also indicates there will b a significant cut down in number of classes.  i joined FF ioi  mall  last year for its many numbers of yoga classes being held every evenings. i hope these classes will not b compromised.","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"during the relocate period can we go other outlets or any celebrity fitness outlet?","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Have a look. A Trainer on the mobile phone during a Pt session. He was doing this for over 10 mins!!! Is this what we pay for? Ask yourselves? Where is the service?? The poor lady paid for his knowledge n time n this is just horrible to watch.","Sentiment":-0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Winnie Lai interested?","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Logan Maurice Norkamarul Norzam check it out","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"in singapore ff there is no extra charges for this....","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Not exactly user friendly experience to click through for pricing to find yet another form to fill in. Let’s just say form abandoned","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"For existing platinum members who already paid lump sum can upgrade?","Sentiment":0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Upgrade at fee for Platinum member? How that be!","Sentiment":0.125,"Source":"Facebook Comment Fitness First"},{"Content":"Hello Fitness First Malaysia i upgrade ready members shift at Wednesday 7\/2\/18 at outlet Fitness First Cheras Leisure Mall but did not not receive this free colling tower.","Sentiment":-0.375,"Source":"Facebook Comment Fitness First"},{"Content":"Aiks i did not get my freebie 😧","Sentiment":-0.75,"Source":"Facebook Comment Fitness First"},{"Content":"Why members sign under AIA is not eligible to upgrade?","Sentiment":-0.5,"Source":"Facebook Comment Fitness First"},{"Content":"so the existing platinum members would have to pay extra for that ? in order to upgrade ?","Sentiment":0.25,"Source":"Facebook Comment Fitness First"},{"Content":"Fitness First Malaysia I just upgraded mine during soft launch at The Curve on Monday, can I claim my free towel? Another question, total CF is 23 clubs excluding upcoming Mytown in KL and Paradigm in JB, so all access include both of these two new outlets? Thanks...","Sentiment":0.5,"Source":"Facebook Comment Fitness First"},{"Content":"Why is Celebrity 1U  and FF The Gardens not included in the list?","Sentiment":-0.5,"Source":"Facebook Comment Fitness First"},{"Content":"So existing ff platinum members would have to pay extra to gain access to cf clubs?","Sentiment":-0.25,"Source":"Facebook Comment Fitness First"},{"Content":"I upgraded at 1MK yesterday but did not receive my towel. Can I get it at other branches, eg Gardens?","Sentiment":-0.625,"Source":"Facebook Comment Fitness First"},{"Content":"Wow i love lions!!! Bojio!!!","Sentiment":1.0,"Source":"Facebook Comment Fitness First"},{"Content":"Ben Lucas your bags","Sentiment":0.125,"Source":"Facebook Comment Fitness First"}]