[{"Review":"I’ve been a member of FF for many years. Of late I can see the dropped in standards in my home gym in Empire Subang. Water disruptions, issues with hot water and cleanliness to name a few. I’m still holding on the my membership due to the lack of better gym. Please buck up FF! The best part is every time I ask to see the manager he’s never around  ","Topic":"member,years,standards,home,gym,empire,water,disruptions,issues,water,cleanliness,membership,lack,gym,part,time,manager","Sentiment":1.625,"Source":"Facebook Review Fitness First"},{"Review":"Poor services and i had been cheated by u!  As u were agree to offer me the previous rate, but ur system charge my for 3months normal rate!! When i call to the staff and complain, they were just give me so many excuses and brush me off!!! Shit!!! Damn!!!   Liar!!!!","Topic":"services,u,rate,system,charge,rate,staff,excuses,shit,damn,liar","Sentiment":-1.625,"Source":"Facebook Review Fitness First"},{"Review":"Hi I have been a fitness first member for more than 5 years now. Of late I have been going for classes at Paradigm and empire for the past one year with Empire being my home gym. Today after classes in paradigm as usual I would take a shower get changed n leave. BUT today some member stole my gym shoes which was put with many shoes under the bench. This is the first time in years that when I left my shoes outside the locker that it was stolen! Yes it's my mistake of leaving it outside but this was a norm as the shoes would be wet. I'm not asking for any compensation or anything of such. I would just like to express my greatest disappointment on how would the other gym members steal from the gym, has this ever happen?!? Appreciate if you could check on the security of the gym\/ type of ppl that join as members or maybe even ppl that join on trial and also acknowledge that this actually did happen at your Paradigm Fitness First Centre.   This is specifically to PARADIGM FITNESS FIRST, Rest assured I have no problem with the quality of the gym in other any areas.","Topic":"member,years,classes,paradigm,empire,year,empire,home,gym,today,classes,paradigm,get,today,member,gym,shoes,shoes,bench,time,years,shoes,locker,yes,mistake,norm,shoes,compensation,disappointment,members,gym,security,type,join,members,join,trial,paradigm,centre,problem,quality,gym,areas","Sentiment":-0.75,"Source":"Facebook Review Fitness First"},{"Review":"Setia City mall class schedule in app and website both stated there is a 9.45am pilates class. When I reach here there is no class, the board has changed but why not update the website and app too? If only the board is accurate who is so free to come check the board everyday? Dont you have a standard operating procedure?","Topic":"city,mall,class,schedule,pilates,class,class,board,website,board,board,standard,procedure","Sentiment":1.375,"Source":"Facebook Review Fitness First"},{"Review":"I think FF members like to roll in the sweat of others. There is no other way to explain why hardly anyone wipes the equipment after use or even places a towel between their soaked body and the machines.   The other day (Setia City) I was the only one using a towel among 11 (!!) athletes working out in the free weight section.   Not even the trainers display basic hygiene but using towels \/ wiping equipment.   Shudder....","Topic":"members,sweat,way,equipment,use,towel,body,machines,day,city,towel,athletes,weight,section,trainers,hygiene,towels,equipment,shudder","Sentiment":-0.625,"Source":"Facebook Review Fitness First"},{"Review":"Relocation of FF IOI Mall has made me and many others disappointed with the way management handled things. All weeknight yoga classes have been cancelled and replaced all with cardio classes. How can this be? Are the cardio-goers paying more fees that the yoga-goers? Where are yoga-goers supposed to go for yoga after work now? The group exercise studio is supposedly larger and yet, there is no room for yoga-goers?","Topic":"relocation,mall,way,management,things,yoga,classes,classes,fees,yoga,work,group,exercise,studio,room","Sentiment":-0.125,"Source":"Facebook Review Fitness First"},{"Review":"Poor service. Could not even provide basic necessity such as small \/ hand towel especially in the morning specifically at Avenue K. Started tracking the incidents and noted that the hand towel was not available on 17 Oct, 20 Oct, 1 Nov & 9 Nov when I arrived at the gym around 7 - 7.20AM. No apology was offered. Kindly ensure your laundry to arrive on time as the gym operation hours start from 6.30AM on weekdays.","Topic":"service,necessity,hand,towel,morning,avenue,incidents,hand,towel,oct,oct,nov,nov,gym,apology,laundry,time,gym,operation,hours,weekdays","Sentiment":-1.75,"Source":"Facebook Review Fitness First"},{"Review":"Within 3 months plus I joined the FF, the staff lost my membership card twice. Now every time I go to the FF the curve Branch I have to be worried whether they will make my card lost again ... ironically, no calling me as promised by the staff regarding the card lost, instead they asked me today to show driving license whenever I enter the gym next time. Another 9 months to go before I terminate the membership if it is still no apology received from the management. That’s it.","Topic":"months,staff,membership,card,time,curve,branch,card,staff,card,today,license,gym,time,months,membership,apology,management","Sentiment":-2.625,"Source":"Facebook Review Fitness First"},{"Review":"I have always prefer FF than other clubs, probably bcos i m a platinum member and platinum clubs are more ummph. Went to the club at Axis yesterday. Was surprised the weights equipments and stepboard in the GX room are those old ones. (Not sure other normal clubs r same). That is fine. But the main concern is the slippery flooring in GX room. Not sure if any member brought up this issue before. I could not do my best in squats and lunges as my legs were getting wider and wider as i did the squats n lunges. Same goes to bodystep. I dare not jump harder cos afraid of fallling due to slippery floor, could FF management improve the flooring?","Topic":"clubs,platinum,member,platinum,clubs,club,axis,yesterday,weights,equipments,room,ones,clubs,concern,flooring,room,member,issue,squats,lunges,legs,squats,lunges,cos,floor,management,flooring","Sentiment":-0.75,"Source":"Facebook Review Fitness First"},{"Review":"The facilities provided are not up to the standard with the amount of fee that we pay every month.... 1) The aircond at Empire was always faulty... 2) The hot water at Empire still not fixed it until today...raining season contribute to the cold weather 3) There's no point if your club manager walking around but cannot find the solution on the problem arise at the club (always saw at Empire)","Topic":"facilities,standard,amount,fee,month,empire,water,empire,today,season,weather,point,club,manager,solution,problem,club,empire","Sentiment":-3.5,"Source":"Facebook Review Fitness First"},{"Review":"wish I read all the recent reviews here before I signed up. Regretting immensely after my horrible experience with their service and cannot even terminate my membership it seems as they are \"unable to refund\" (even though it was them that lied to me and didnt keep to their word and basically charged my card secretly). The staff that put me in this mess is still working there it seems, so future joiners be careful.","Topic":"reviews,experience,service,membership,word,card,staff,mess,joiners","Sentiment":-1.75,"Source":"Facebook Review Fitness First"},{"Review":"I cancelled my membership since May 2017. I walked in to The Curve branch where I registered, filled the form and even got a cancellation email. But I am really disappointed that they keep on charging me the fees via direct debit. The latest one was yesterday, 21 November 2017. I lost almost RM1000 for the membership that supposed to be TERMINATED already. I have called to complain numerous times and when talking to staffs  there got me nowhere, I asked to speak to the manager. But, the manager seemed to be busy or in a meeting everytime. Everytime I called, the staff would say that the manager already addressing the issue, will terminate my membership and even promise to compensate the money that I paid. Months passed since then and I feel really angry even to call because I know it will get me nowhere. Maybe I should make a complaint elsewhere since asking politely to the branch involved seems useless.","Topic":"membership,curve,branch,form,cancellation,email,fees,debit,one,yesterday,november,membership,times,manager,manager,meeting,staff,manager,issue,membership,money,months,complaint,branch","Sentiment":-1.375,"Source":"Facebook Review Fitness First"},{"Review":"I have been informed very friendly by your front desk that fitness first Melawati Mall is only open to new sign up MM members. They mentioned that old members have been informed. The front desk mentioned that they got the memo from the GM this morning about this restriction. Please forward me the email as i might have missed.  I understand being so many years a platinum member is not eligible to have these benefits and have utter restrictions. So, please send me details on when i am able again to step my foot next in FF Melawati Mall.","Topic":"front,desk,mall,sign,members,members,front,desk,memo,gm,morning,restriction,email,years,platinum,member,benefits,restrictions,details,foot,mall","Sentiment":2.75,"Source":"Facebook Review Fitness First"},{"Review":"I was conned to rejoin Fitness First with the promise of being given my old membership rate. The staff who promised left after I rejoined. When I confromted. fitness First,  they feign ignorance and put the blame on me,  that I didnt secure a black and white. When I was given my contract I had already highlighted it was not the rate I was offered. I was again told it will be rectified.  Finally I asked someone by the name of Alex who gave a false promise he will rectify the matter who also failed to follow through and assigned the blame on me. This is how they operate, not keeping their words. So beware you all, never trust anything they say.","Topic":"promise,membership,rate,staff,left,ignorance,blame,contract,rate,someone,name,promise,matter,blame,words","Sentiment":-2.125,"Source":"Facebook Review Fitness First"},{"Review":"It took me one and a half hour to reach your Empire Subang club intending to attend your Gentle Flow Yoga at the pool side. I turned rounds and rounds to find parking in the mall and rushed into the gym to find that your Gentle Flow Yoga class at 730pm is not available?  There is nobody there. I have checked the club timetable just before coming and the class is on! Your counter person dont even know there is nobody there. She was even in disbelief and I had to double check it twice for her. She said the class is supposed to be on and she had to text to realise there is no class and just say a simple sorry. Do you know how much hassle or effort people put through to commute to the gym? Do you know how idiotic it feels to come to your gym and to be put off by the class is not on? And you do not bother to maintain the quality of your service?  When you are comfortably having your dinner now, I am fucking pissed with your club's services. Being a world renowed Fitness First, is this how you treat your customer?  I was your member for 7 years at the Curve. The same thing happened few times. You use your club studio for your own internal functions and not informing your customer. Frequently I was so disappointed to only realised classes cancel only upon at your club premise.  Seems like your club service has not improved after all these years. Bloody disappointing Fitness First! Nobody cares and just take this lightly. I really have zero confidence in your classes now. You seriously dont care about your club image at all.   #FitnessFirst #FitnessFirsMalaysia #FitnessFirstMalaysiaEmpireSubang","Topic":"hour,empire,club,yoga,pool,side,rounds,rounds,parking,mall,gym,yoga,class,nobody,club,timetable,class,counter,person,nobody,disbelief,class,class,hassle,effort,people,gym,gym,class,quality,service,dinner,club,services,world,customer,member,years,curve,thing,times,club,studio,functions,customer,classes,club,premise,club,service,years,nobody,cares,confidence,classes,care,club,image","Sentiment":-0.5,"Source":"Facebook Review Fitness First"},{"Review":"Horrible experience with this club. They will take your money without your authorization. I sustained a muscle\/tendon injury during one of my sessions there so had to stop and freeze my account with a doctor's letter. However after 6 months they reactivated my account without first informing me or asking if I was okay to return. I didn't check my credit card bill for a few months but when I did I realized they had charged me for 6 months already. Cut a long story short. I tried to cancel my membership (I was not on contract anymore) because my shoulder was still stiff and there was no way I could return to my normal classes. Tried to cancel my membership and ask for a refund on the 6 months fees that they tried to charge. It was impossible for them to agree. I have been fighting to get my money back and for them to waive the freezing fees to no avail. This club does not care about their members. It's all about the money for them.","Topic":"experience,club,money,authorization,injury,sessions,account,doctor,letter,months,account,credit,card,bill,months,months,story,membership,contract,shoulder,way,classes,membership,refund,months,fees,money,freezing,fees,avail,club,members,money","Sentiment":-4.875,"Source":"Facebook Review Fitness First"},{"Review":"Poor service, poor management team.. I called to cancel my membership and your side give me many excuses, said that my contract have not end? Funny, when I sign up for the membership, your side told me that I can discontinue my membership after 3 months, and I have been joined FF for almost a year.. I cannot cancel my membership now? My sister join FF with me on same time, she have get her FF membership cancellation two months ago, but why I can't? And been told because my account been freeze?? Every month I pay full amount for the membership fee, if my account is in freeze condition then who is taking the money??  Plus, Trainer there also not good.. I sign up for 30 session, but until the session period end, my training session have not finish.. Always make appointment with trainer but at the end did not show up and not reply to my message, so mostly I do training myself, so demotivated..","Topic":"service,management,membership,side,excuses,contract,funny,membership,side,membership,months,membership,sister,join,time,membership,cancellation,months,account,month,amount,membership,fee,account,freeze,condition,money,trainer,session,session,period,end,training,session,appointment,trainer,end,message","Sentiment":-3.875,"Source":"Facebook Review Fitness First"},{"Review":"Fitness First's management service getting from bad to worst for my 15 years journey with them especially I am terminating my membership now. Terminating my membership in mid of Nov and was told this can't be done and will get someone from home club to call me on this matter and yet to receive any call for 2 weeks on this and personally call home club on early Dec due I am on oversea biz travel and was given lots of excuses and surprised to find out that my effective last day is on 31 Jan 2018 when checked. My intention is to terminate with immediate effect (which was told is 1 month notice, why is my friend been terminated immediately by FF without any reason) but end up with 2 months notice? Personally felt that Fitness First is now a 'Business First' club with their arrogant management attitude towards the loyal members.","Topic":"management,service,years,journey,membership,membership,nov,someone,home,club,matter,call,weeks,home,club,dec,biz,travel,lots,excuses,day,jan,intention,effect,month,notice,friend,reason,months,club,management,attitude,members","Sentiment":-0.5,"Source":"Facebook Review Fitness First"},{"Review":"Best.","Topic":"","Sentiment":0.75,"Source":"Facebook Review Fitness First"}]